pandas is an open source library for real world data analysis in python. it is built on top of numpy

using pandas data can be cleande transformed manipulated and analyzed

seriees object is a one dimensional lableled array. is supports different data type like integer, float, string etc..

a datafreams in pandas is a two- dimensional tabular data structure similar to spradsheet or sql table.

In [15]:
import pandas as pd

In [16]:
s1  = pd.Series([10,20,30,40,50])
s1

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [17]:
s2 = pd.Series([10,20,30,40,50], index=['A','B','C','D','E'])
s2

A    10
B    20
C    30
D    40
E    50
dtype: int64

In [18]:
s1.values

array([10, 20, 30, 40, 50])

In [19]:
s2.values

array([10, 20, 30, 40, 50])

In [20]:
s2.index

Index(['A', 'B', 'C', 'D', 'E'], dtype='object')

In [21]:
s1.index

RangeIndex(start=0, stop=5, step=1)

In [22]:
data = [{'Name':'Ankit','Marks':21},
        {'Name':'Ram','Marks':22},
        {'Name':'Jetho','Marks':23},
        {'Name':'Popaat','Marks':44}]
f1=pd.DataFrame(data)
f1

     Name  Marks
0   Ankit     21
1     Ram     22
2   Jetho     23
3  Popaat     44

In [23]:
print(f1)

     Name  Marks
0   Ankit     21
1     Ram     22
2   Jetho     23
3  Popaat     44

In [24]:
type(f1)

pandas.core.frame.DataFrame

In [25]:
type(data)

list

In [26]:
import pandas as pd
data = pd.read_excel('student.xlsx')
data

     Name Branch Division
0     NaN    NaN      NaN
1   Mihir     IT        A
2  Dhiraj     CE        B
3   Rahul     IT        C
4  Hardik     CE        B
5   Aryan     IT        B

d

In [27]:

iris = pd.read_csv('Iris.csv')

In [28]:
iris.head()

   Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
0   1            5.1           3.5            1.4           0.2  Iris-setosa
1   2            4.9           3.0            1.4           0.2  Iris-setosa
2   3            4.7           3.2            1.3           0.2  Iris-setosa
3   4            4.6           3.1            1.5           0.2  Iris-setosa
4   5            5.0           3.6            1.4           0.2  Iris-setosa

In [29]:
iris.tail()

,Id,SepalLengthCm,SepalWidthCm,PetalLengthCm,PetalWidthCm,Species
145,146,6.7,3.0,5.2,2.3,Iris-virginica
146,147,6.3,2.5,5.0,1.9,Iris-virginica
147,148,6.5,3.0,5.2,2.0,Iris-virginica
148,149,6.2,3.4,5.4,2.3,Iris-virginica
149,150,5.9,3.0,5.1,1.8,Iris-virginica

In [30]:
iris.describe()

               Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm
count  150.000000     150.000000    150.000000     150.000000    150.000000
mean    75.500000       5.843333      3.054000       3.758667      1.198667
std     43.445368       0.828066      0.433594       1.764420      0.763161
min      1.000000       4.300000      2.000000       1.000000      0.100000
25%     38.250000       5.100000      2.800000       1.600000      0.300000
50%     75.500000       5.800000      3.000000       4.350000      1.300000
75%    112.750000       6.400000      3.300000       5.100000      1.800000
max    150.000000       7.900000      4.400000       6.900000      2.500000

In [31]:
iris.isna().sum()

Id               0
SepalLengthCm    0
SepalWidthCm     0
PetalLengthCm    0
PetalWidthCm     0
Species          0
dtype: int64

In [32]:
cat = iris['Species'].unique()

In [33]:
cat

array(['Iris-setosa', 'Iris-versicolor', 'Iris-virginica'], dtype=object)

In [34]:
iris.replace("Iris-setosa","setosa",inplace=True)

In [35]:
iris.replace("Iris-versicolor","versicolour",inplace=True)

In [36]:
iris.replace("Iris-virginica","virginica",inplace=True)

In [37]:
iris.describe()

               Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm
count  150.000000     150.000000    150.000000     150.000000    150.000000
mean    75.500000       5.843333      3.054000       3.758667      1.198667
std     43.445368       0.828066      0.433594       1.764420      0.763161
min      1.000000       4.300000      2.000000       1.000000      0.100000
25%     38.250000       5.100000      2.800000       1.600000      0.300000
50%     75.500000       5.800000      3.000000       4.350000      1.300000
75%    112.750000       6.400000      3.300000       5.100000      1.800000
max    150.000000       7.900000      4.400000       6.900000      2.500000

In [38]:
iris.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Id             150 non-null    int64
 1   SepalLengthCm  150 non-null    float64
 2   SepalWidthCm   150 non-null    float64
 3   PetalLengthCm  150 non-null    float64
 4   PetalWidthCm   150 non-null    float64
 5   Species        150 non-null    object
dtypes: float64(4), int64(1), object(1)
memory usage: 7.2+ KB

In [39]:
iris[['SepalLengthCm','SepalWidthCm']].head(10)

   SepalLengthCm  SepalWidthCm
0            5.1           3.5
1            4.9           3.0
2            4.7           3.2
3            4.6           3.1
4            5.0           3.6
5            5.4           3.9
6            4.6           3.4
7            5.0           3.4
8            4.4           2.9
9            4.9           3.1

In [40]:
#g add new colunm with condititon
def yes_no(SepalLengthCm):
    return 'YES' if SepalLengthCm >=5 else 'NO'
#apply fuction to creat new colunm
iris['Result'] = iris['SepalLengthCm'].apply(yes_no)
iris

,Id,SepalLengthCm,SepalWidthCm,PetalLengthCm,PetalWidthCm,Species,Result
0,1,5.1,3.5,1.4,0.2,setosa,YES
1,2,4.9,3.0,1.4,0.2,setosa,NO
2,3,4.7,3.2,1.3,0.2,setosa,NO
3,4,4.6,3.1,1.5,0.2,setosa,NO
4,5,5.0,3.6,1.4,0.2,setosa,YES
...,...,...,...,...,...,...,...
145,146,6.7,3.0,5.2,2.3,virginica,YES
146,147,6.3,2.5,5.0,1.9,virginica,YES
147,148,6.5,3.0,5.2,2.0,virginica,YES
148,149,6.2,3.4,5.4,2.3,virginica,YES
149,150,5.9,3.0,5.1,1.8,virginica,YES

In [41]:
iris.columns

Index(['Id', 'SepalLengthCm', 'SepalWidthCm', 'PetalLengthCm', 'PetalWidthCm',
       'Species', 'Result'],
      dtype='object')

the .iloc indexer is primarily used for integer-location based inedxing

In [42]:
iris.iloc[51:56]

,Id,SepalLengthCm,SepalWidthCm,PetalLengthCm,PetalWidthCm,Species,Result
51,52,6.4,3.2,4.5,1.5,versicolour,YES
52,53,6.9,3.1,4.9,1.5,versicolour,YES
53,54,5.5,2.3,4.0,1.3,versicolour,YES
54,55,6.5,2.8,4.6,1.5,versicolour,YES
55,56,5.7,2.8,4.5,1.3,versicolour,YES

In [43]:
iris.drop('Result',axis=1,inplace=True)

In [44]:
iris.iloc[51:56,[2,5]]

    SepalWidthCm      Species
51           3.2  versicolour
52           3.1  versicolour
53           2.3  versicolour
54           2.8  versicolour
55           2.8  versicolour

In [45]:
iris.iloc[51:56,2:5]

    SepalWidthCm  PetalLengthCm  PetalWidthCm
51           3.2            4.5           1.5
52           3.1            4.9           1.5
53           2.3            4.0           1.3
54           2.8            4.6           1.5
55           2.8            4.5           1.3

In [46]:
iris[iris['PetalLengthCm'] > 5]

,Id,SepalLengthCm,SepalWidthCm,PetalLengthCm,PetalWidthCm,Species
83,84,6.0,2.7,5.1,1.6,versicolour
100,101,6.3,3.3,6.0,2.5,virginica
101,102,5.8,2.7,5.1,1.9,virginica
102,103,7.1,3.0,5.9,2.1,virginica
103,104,6.3,2.9,5.6,1.8,virginica
104,105,6.5,3.0,5.8,2.2,virginica
105,106,7.6,3.0,6.6,2.1,virginica
107,108,7.3,2.9,6.3,1.8,virginica
108,109,6.7,2.5,5.8,1.8,virginica
109,110,7.2,3.6,6.1,2.5,virginica
110,111,6.5,3.2,5.1,2.0,virginica
111,112,6.4,2.7,5.3,1.9,virginica
112,113,6.8,3.0,5.5,2.1,virginica
114,115,5.8,2.8,5.1,2.4,virginica
115,116,6.4,3.2,5.3,2.3,virginica
116,117,6.5,3.0,5.5,1.8,virginica
117,118,7.7,3.8,6.7,2.2,virginica
118,119,7.7,2.6,6.9,2.3,virginica
120,121,6.9,3.2,5.7,2.3,virginica
122,123,7.7,2.8,6.7,2.0,virginica
124,125,6.7,3.3,5.7,2.1,virginica
125,126,7.2,3.2,6.0,1.8,virginica
128,129,6.4,2.8,5.6,2.1,virginica
129,130,7.2,3.0,5.8,1.6,virginica
130,131,7.4,2.8,6.1,1.9,virginica
131,132,7.9,3.8,6.4,2.0,virginica
132,133,6.4,2.8,5.6,2.2,virginica
133,134,6.3,2.8,5.1,1.5,virginica
134,135,6.1,2.6,5.6,1.4,virginica
135,136,7.7,3.0,6.1,2.3,virginica
136,137,6.3,3.4,5.6,2.4,virginica
137,138,6.4,3.1,5.5,1.8,virginica
139,140,6.9,3.1,5.4,2.1,virginica
140,141,6.7,3.1,5.6,2.4,virginica
141,142,6.9,3.1,5.1,2.3,virginica
142,143,5.8,2.7,5.1,1.9,virginica
143,144,6.8,3.2,5.9,2.3,virginica
144,145,6.7,3.3,5.7,2.5,virginica
145,146,6.7,3.0,5.2,2.3,virginica
147,148,6.5,3.0,5.2,2.0,virginica
148,149,6.2,3.4,5.4,2.3,virginica
149,150,5.9,3.0,5.1,1.8,virginica

In [47]:
iris[ (iris['PetalLengthCm'] > 6 ) & (iris['Species']  == 'virginica')]

      Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm    Species
105  106            7.6           3.0            6.6           2.1  virginica
107  108            7.3           2.9            6.3           1.8  virginica
109  110            7.2           3.6            6.1           2.5  virginica
117  118            7.7           3.8            6.7           2.2  virginica
118  119            7.7           2.6            6.9           2.3  virginica
122  123            7.7           2.8            6.7           2.0  virginica
130  131            7.4           2.8            6.1           1.9  virginica
131  132            7.9           3.8            6.4           2.0  virginica
135  136            7.7           3.0            6.1           2.3  virginica

In [48]:
iris.duplicated()

0      False
1      False
2      False
3      False
4      False
       ...
145    False
146    False
147    False
148    False
149    False
Length: 150, dtype: bool

In [50]:
iris.duplicated().sum()

np.int64(0)

In [56]:
student = pd.read_csv('student_info.csv')

In [57]:
student.columns

Index(['study_hours', 'student_marks'], dtype='object')

In [58]:
student.info

<bound method DataFrame.info of      study_hours  student_marks
0           6.83          78.50
1           6.56          76.74
2            NaN          78.68
3           5.67          71.82
4           8.67          84.19
..           ...            ...
195         7.53          81.67
196         8.56          84.68
197         8.94          86.75
198         6.60          78.05
199         8.35          83.50

[200 rows x 2 columns]>

In [59]:
student.head()

   study_hours  student_marks
0         6.83          78.50
1         6.56          76.74
2          NaN          78.68
3         5.67          71.82
4         8.67          84.19

In [60]:
student.tail()

     study_hours  student_marks
195         7.53          81.67
196         8.56          84.68
197         8.94          86.75
198         6.60          78.05
199         8.35          83.50

In [61]:
student.notnull().sum()

study_hours      195
student_marks    200
dtype: int64

In [62]:
student.isnull().sum()

study_hours      5
student_marks    0
dtype: int64

In [63]:
student.isna().sum()

study_hours      5
student_marks    0
dtype: int64

In [64]:
student['study_hours']=student['study_hours'].fillna(student['study_hours']).mean()

In [65]:
from ucimlrepo import fetch_ucirepo 
  
# fetch dataset 
adult = fetch_ucirepo(id=2) 
  
# data (as pandas dataframes) 
X = adult.data.features 
y = adult.data.targets 
  
# metadata 
print(adult.metadata) 
  
# variable information 
print(adult.variables)

{'uci_id': 2, 'name': 'Adult', 'repository_url': 'https://archive.ics.uci.edu/dataset/2/adult', 'data_url': 'https://archive.ics.uci.edu/static/public/2/data.csv', 'abstract': 'Predict whether annual income of an individual exceeds $50K/yr based on census data. Also known as "Census Income" dataset. ', 'area': 'Social Science', 'tasks': ['Classification'], 'characteristics': ['Multivariate'], 'num_instances': 48842, 'num_features': 14, 'feature_types': ['Categorical', 'Integer'], 'demographics': ['Age', 'Income', 'Education Level', 'Other', 'Race', 'Sex'], 'target_col': ['income'], 'index_col': None, 'has_missing_values': 'yes', 'missing_values_symbol': 'NaN', 'year_of_dataset_creation': 1996, 'last_updated': 'Tue Sep 24 2024', 'dataset_doi': '10.24432/C5XW20', 'creators': ['Barry Becker', 'Ronny Kohavi'], 'intro_paper': None, 'additional_info': {'summary': "Extraction was done by Barry Becker from the 1994 Census database.  A set of reasonably clean records was extracted using the following conditions: ((AAGE>16) && (AGI>100) && (AFNLWGT>1)&& (HRSWK>0))\n\nPrediction task is to determine whether a person's income is over $50,000 a year.\n", 'purpose': None, 'funded_by': None, 'instances_represent': None, 'recommended_data_splits': None, 'sensitive_data': None, 'preprocessing_description': None, 'variable_info': 'Listing of attributes:\r\n\r\n>50K, <=50K.\r\n\r\nage: continuous.\r\nworkclass: Private, Self-emp-not-inc, Self-emp-inc, Federal-gov, Local-gov, State-gov, Without-pay, Never-worked.\r\nfnlwgt: continuous.\r\neducation: Bachelors, Some-college, 11th, HS-grad, Prof-school, Assoc-acdm, Assoc-voc, 9th, 7th-8th, 12th, Masters, 1st-4th, 10th, Doctorate, 5th-6th, Preschool.\r\neducation-num: continuous.\r\nmarital-status: Married-civ-spouse, Divorced, Never-married, Separated, Widowed, Married-spouse-absent, Married-AF-spouse.\r\noccupation: Tech-support, Craft-repair, Other-service, Sales, Exec-managerial, Prof-specialty, Handlers-cleaners, Machine-op-inspct, Adm-clerical, Farming-fishing, Transport-moving, Priv-house-serv, Protective-serv, Armed-Forces.\r\nrelationship: Wife, Own-child, Husband, Not-in-family, Other-relative, Unmarried.\r\nrace: White, Asian-Pac-Islander, Amer-Indian-Eskimo, Other, Black.\r\nsex: Female, Male.\r\ncapital-gain: continuous.\r\ncapital-loss: continuous.\r\nhours-per-week: continuous.\r\nnative-country: United-States, Cambodia, England, Puerto-Rico, Canada, Germany, Outlying-US(Guam-USVI-etc), India, Japan, Greece, South, China, Cuba, Iran, Honduras, Philippines, Italy, Poland, Jamaica, Vietnam, Mexico, Portugal, Ireland, France, Dominican-Republic, Laos, Ecuador, Taiwan, Haiti, Columbia, Hungary, Guatemala, Nicaragua, Scotland, Thailand, Yugoslavia, El-Salvador, Trinadad&Tobago, Peru, Hong, Holand-Netherlands.', 'citation': None}}
              name     role         type      demographic  \
0              age  Feature      Integer              Age
1        workclass  Feature  Categorical           Income
2           fnlwgt  Feature      Integer             None
3        education  Feature  Categorical  Education Level
4    education-num  Feature      Integer  Education Level
5   marital-status  Feature  Categorical            Other
6       occupation  Feature  Categorical            Other
7     relationship  Feature  Categorical            Other
8             race  Feature  Categorical             Race
9              sex  Feature       Binary              Sex
10    capital-gain  Feature      Integer             None
11    capital-loss  Feature      Integer             None
12  hours-per-week  Feature      Integer             None
13  native-country  Feature  Categorical            Other
14          income   Target       Binary           Income

                                          description units missing_values
0                                                 N/A  None             no
1   Private, Self-emp-not-inc, Self-emp-inc, Feder...  None            yes
2                                                None  None             no
3    Bachelors, Some-college, 11th, HS-grad, Prof-...  None             no
4                                                None  None             no
5   Married-civ-spouse, Divorced, Never-married, S...  None             no
6   Tech-support, Craft-repair, Other-service, Sal...  None            yes
7   Wife, Own-child, Husband, Not-in-family, Other...  None             no
8   White, Asian-Pac-Islander, Amer-Indian-Eskimo,...  None             no
9                                       Female, Male.  None             no
10                                               None  None             no
11                                               None  None             no
12                                               None  None             no
13  United-States, Cambodia, England, Puerto-Rico,...  None            yes
14                                       >50K, <=50K.  None             no

In [68]:
X.isna().sum()

age                 0
workclass         963
fnlwgt              0
education           0
education-num       0
marital-status      0
occupation        966
relationship        0
race                0
sex                 0
capital-gain        0
capital-loss        0
hours-per-week      0
native-country    274
dtype: int64

In [69]:
X.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 48842 entries, 0 to 48841
Data columns (total 14 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   age             48842 non-null  int64
 1   workclass       47879 non-null  object
 2   fnlwgt          48842 non-null  int64
 3   education       48842 non-null  object
 4   education-num   48842 non-null  int64
 5   marital-status  48842 non-null  object
 6   occupation      47876 non-null  object
 7   relationship    48842 non-null  object
 8   race            48842 non-null  object
 9   sex             48842 non-null  object
 10  capital-gain    48842 non-null  int64
 11  capital-loss    48842 non-null  int64
 12  hours-per-week  48842 non-null  int64
 13  native-country  48568 non-null  object
dtypes: int64(6), object(8)
memory usage: 5.2+ MB

In [70]:
X['workclass'].unique()

array(['State-gov', 'Self-emp-not-inc', 'Private', 'Federal-gov',
       'Local-gov', '?', 'Self-emp-inc', 'Without-pay', 'Never-worked',
       nan], dtype=object)

In [72]:
X.loc[:,'workclass']=X['workclass'].fillna(X['workclass'].mode()[0])

In [73]:
X.isna().sum()

age                 0
workclass           0
fnlwgt              0
education           0
education-num       0
marital-status      0
occupation        966
relationship        0
race                0
sex                 0
capital-gain        0
capital-loss        0
hours-per-week      0
native-country    274
dtype: int64

In [74]:
X.loc[:,'occupation']=X['occupation'].fillna(X['occupation'].mode()[0])

In [75]:
X.isna().sum()

age                 0
workclass           0
fnlwgt              0
education           0
education-num       0
marital-status      0
occupation          0
relationship        0
race                0
sex                 0
capital-gain        0
capital-loss        0
hours-per-week      0
native-country    274
dtype: int64

In [77]:
X.dropna()

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
48837,39,Private,215419,Bachelors,13,Divorced,Prof-specialty,Not-in-family,White,Female,0,0,36,United-States
48838,64,Private,321403,HS-grad,9,Widowed,Prof-specialty,Other-relative,Black,Male,0,0,40,United-States
48839,38,Private,374983,Bachelors,13,Married-civ-spouse,Prof-specialty,Husband,White,Male,0,0,50,United-States
48840,44,Private,83891,Bachelors,13,Divorced,Adm-clerical,Own-child,Asian-Pac-Islander,Male,5455,0,40,United-States
48841,35,Self-emp-inc,182148,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,60,United-States

In [78]:
X.dropna(inplace=True)

C:\Users\LENOVO\AppData\Local\Temp\ipykernel_11824\490656300.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  X.dropna(inplace=True)